app/controllers/ambientes_controller.rb

SELECT "ambientes".* FROM "ambientes"
---
  def index
    @ambientes = Ambiente.all

INSERT INTO "ambientes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sala"], ["created_at", "2016-05-04 21:58:05.079505"], ["updated_at", "2016-05-04 21:58:05.079505"]]
---
  def create
    @ambiente = Ambiente.new(ambiente_params)

    respond_to do |format|
      if @ambiente.save

UPDATE "ambientes" SET "name" = ?, "updated_at" = ? WHERE "ambientes"."id" = ?  [["name", "teste sala"], ["updated_at", "2016-06-19 14:29:42.298306"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @ambiente.update(ambiente_params)

DELETE FROM "ambientes" WHERE "ambientes"."id" = ?  [["id", 3]]
---
  def destroy
    @ambiente.destroy

SELECT  "ambientes".* FROM "ambientes" WHERE "ambientes"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_ambiente
      @ambiente = Ambiente.find(params[:id])